label WasFound:    
    scene black
    "Затем, я заметила какой-то след..."
    "Крови."
    "Соврершенно незадумываясь, я пошла по этому следу."
    "Он привёл меня в какой-то подвал."
    "Я открыла дверь."

    #Та самая кровавая сцена

    "Вокруг лежало куча трупов. Море крови."
    "Они все были... Изуродованы?"
    "И это были оперативники."
    "Конечности все переломаны, а форма стёрта, будто бы ластиком."
    "По середине, связанный, на стуле, сидел Ваня!"
    "Я уж хотела была побежать, но решила осмотреться, нет ли каких либо ловушек..."
    "Убедившись, что путь свободен, я резко рванула к своему другу и начала его развязывать."
    "Если я была более стойкая, то вот Ваня... Он аж начал заикаться..."

    play sound "smile.mp3"
    vana "Ошибка 403"
    vana "Ошибка 403"
    vana "Ошибка 403"
    play sound "smile.mp3"

    mary "Спокуха... Ты живой, и это главное..."
    "Затем, взяв его за руку, медленно вышла из комнаты..."
    "Не зная, что же делать дальше..."
    return